{
  "id": "2026-02-13-my-first-vibe-coding-project-vocabapp",
  "title": "My first vibe coding project - VocabApp",
  "date": "2026-02-13",
  "content": "# Building VocabApp: A Reading Tool That Speaks My Language \n\nI moved to the U.S. from China at 17. Daily conversation came quickly, but expanding my vocabulary through reading was frustrating. I'd look up words constantly, lose my place in the book, and then forget those same words a week later.The problem wasn't just the interruption. It was that looking up words and actually learning them were completely disconnected. I needed a tool that did both.That's why I built VocabApp.\n\n# What It Does\nVocabApp combines reading and vocabulary learning in one place.\nYou upload a PDF or paste an article. When you see an unfamiliar word, tap it for the Chinese translation, English definition, and pronunciation. Tap again to save it to your word bank. Later, the app quizzes you on those specific words using spaced repetition.\nThe key advantage: you're learning vocabulary from your own reading material, not generic word lists. The context makes words easier to remember. The systematic review makes them stick long term.\nYou look up each word once, then the app handles the rest.\n\n# How It Works\nThink of VocabApp in three layers: what users see, what the server does, and where data lives.\n## Frontend: Next.js + React\nThe app runs in the browser. I used Next.js for file-based routing, where each file maps to a URL (sign-in, upload, PDF reader, library, flashcard review). React manages the UI state, keeping everything smooth when you switch between reading and reviewing.\n## Backend: API Routes + Translation\nWhen you tap a word, the server processes it through the translation API, fetches the Chinese meaning and English definition, adds pronunciation data, and returns everything in under a second. I built this using Next.js API routes, avoiding the need for a separate backend service.\n## Database: Supabase\nSupabase handles authentication, data storage, and file uploads. It tracks which words you've saved, stores translations, manages your PDF library, and monitors review progress for spaced repetition. One service, one SDK, no configuration overhead.\n## Deployment: Vercel\nVercel hosts the app with automatic deployments from GitHub. It handles scaling and CDN distribution without manual setup.\n\n# Why This Stack?\nI chose these tools for speed and simplicity.\nNext.js gave me both frontend and API capability in one framework. React made complex UI state manageable. Supabase eliminated backend setup. Vercel removed deployment complexity.\nThe entire stack let me focus on solving the vocabulary problem instead of managing infrastructure.\n\n# What I Learned\nBuilding for yourself clarifies every decision. I made VocabApp because I needed it, which made trade-offs obvious.\nThe biggest lesson: integrated tools matter more than I expected. Using Supabase and Vercel meant less time on configuration, more time on features.\nAnd the best learning tool isn't the one with the most features. It's the one that gets out of your way when you don't need it and appears instantly when you do.\n\n### Want to see the demo?\n### Want to try it? [Link to your app]\n### See the code? [Link to GitHub repo]",
  "excerpt": "Building VocabApp: A Reading Tool That Speaks My Language \n\nI moved to the U.S. from China at 17. Daily conversation came quickly, but expanding my v..."
}