{
  "id": "2026-02-13-my-first-vibe-coding-project-vocabapp",
  "title": "My first vibe coding project - VocabApp",
  "date": "2026-02-13",
  "content": "# Building VocabApp: A Reading Tool That Speaks My Language \n\nI moved to the U.S. from China at 17. Daily conversation came quickly, but expanding my vocabulary through reading was frustrating. I'd look up words constantly, lose my place in the book, and then forget those same words a week later. The problem wasn't just the interruption. It was that looking up words and actually learning them were completely disconnected. I needed a tool that did both. That's why I built VocabApp.\n\n# What It Does\nVocabApp combines reading and vocabulary learning in one place.\nYou upload a PDF or paste a long article from X. When you see an unfamiliar word, tap it for the Chinese translation, English definition, and pronunciation. Tap again to save it to your word bank. Later, you can come back to the app to quiz yourself on those words, track your progress, and categorize them by how well you know them.\n\n> The key advantage: you're learning vocabulary from your own reading material, not generic word lists. The context makes words easier to remember. The systematic review makes them stick long term. You look up each word once, then the app handles the rest.\n\n\n# How It Works\nThink of VocabApp in three layers: what users see, what the server does, and where data lives.\n## Frontend: Next.js + React\nThe app runs in the browser. We (obv me and my buddy Claude) used Next.js for file-based routing, where each file maps to a URL (sign-in, upload, PDF reader, library, flashcard review). React manages the UI state, keeping everything smooth when you switch between reading and reviewing.\n## Backend: API Routes + Translation\nWhen you tap a word, the server first calls Free MyMemory API for the Chinese translation. If that fails (no internet, rate limit, etc.), it falls back to a free, local dictionary (CC-CEDICT). Meanwhile, the browser fetches the English definition and pronunciation from Free Dictionary API. Everything returns in under a second. We built this using Next.js API routes, avoiding the need for a separate backend service.\n## Database: Supabase\nSupabase handles authentication, data storage, and file uploads. It tracks which words you've saved, stores translations, and manages your PDF library. One service, one SDK, no configuration overhead.\n## Deployment: Vercel\nVercel hosts the app with automatic deployments from GitHub. It handles scaling and CDN distribution without manual setup.\n\n# Data Flow\nHere's the data flow for the most important user action — reading a PDF and saving a word:\n![Reading and saving words](Images/Technical/reading%20and%20saving.png)\n\nAnd the flashcard review flow:\n![Flashcard review](Images/Technical/flashcard.png)\n\n# The Biggest Challenge: Translation Accuracy on a Budget\nI didn't want to spend money on premium translation APIs, so I first tried reversing CC-CEDICT, a free Chinese-to-English dictionary, to work as English-to-Chinese.\nBad idea. Looking up \"control\" and it returned a character so obscure most native Chinese speakers have never seen it. \n\n## The problem: \nReverse lookups create many-to-one mappings where the simplest English definition wins, and those often belong to archaic characters nobody uses.\n## The fix came in three parts. \nFirst, we switched to MyMemory API as the primary source, which solved 95% of cases. Then Claude hand-curated 600+ overrides for common words in the CC-CEDICT dictionary. Finally, we added smarter scoring to the dictionary builder: single-character results get penalized, archaic terms get filtered out, modern 2-3 character words get boosted.\n\n# What I Learned\n> Building for yourself clarifies every decision. I made VocabApp because I needed it, which made trade-offs obvious.\n\n> Testing on real devices matters. Desktop behavior is predictable. Mobile is not. I should have tested on phones much earlier instead of assuming the desktop experience would translate.\n\n> Use Claude Code Plan mode, discussing it first saved hours of rewriting.\n\n> Good prompts matter. Use another model to help refine the prompt.\n\n\n### Want to see the demo?[Link to Demo] \n### Want to try it? [VocabApp](https://vocabapp-khaki.vercel.app)\n### See the code? [GitHub](https://github.com/liwushuang123/VocabApp)",
  "excerpt": "Building VocabApp: A Reading Tool That Speaks My Language \n\nI moved to the U.S. from China at 17. Daily conversation came quickly, but expanding my v..."
}