{
  "id": "2026-02-13-my-first-vibe-coding-project-vocabapp",
  "title": "My first vibe coding project - VocabApp",
  "date": "2026-02-13",
  "content": "# What Is This Thing?\n\nAs someone who grew up in China and whose native language is Chinese, I’ve always tried to find better ways to improve my English vocabulary. Daily conversation helped at first, but after a while it wasn’t enough, so I started reading more.\nHowever, I often struggled to finish books. If I can finish a Chinese book in one week, it might take me months to finish one in English. Every time I encounter an unfamiliar word, I have to pull out my phone, open a dictionary app, type in the word, read the translation, and then go back to the book. After doing this ten times, I’ve completely lost the flow of reading.\n\nThat frustration is what inspired me to create **VocabApp**.\n\nVocabApp removes that friction. You can upload a PDF or paste an article and read it directly in the app. When you see a word you don’t know, you simply tap it—instantly you get the Chinese translation, an English definition, and pronunciation. With one more tap, the word is saved to your personal word bank.\nLater, the app quizzes you on those words using a scientifically proven spaced-repetition system, helping you remember them for the long term instead of forgetting them after a few days.\n\nIt’s a reading app and a vocabulary trainer that share the same brain.\n\n# The Architecture — How the Pieces Fit Together\nBy no means that I am a software engineer, but I do understand the system. The analogy that I usually use to describe a system is think of VocabApp like a restaurant. There's a dining room (what the user sees), a kitchen (the server that does the heavy lifting), and a pantry (the database where everything is stored).\n\n## The dining room: Next.js + React Frontend\nEverything runs in the browser. The app is built with Next.js 16 (App Router) and React 19. We (I mean me and Claude) use Next.js's file-based routing, each file in `app/` maps directly to a URL, including: **Sign in, Create account, Upload PDF or paste article, PDF reader (the star of the show), Article reader, Your library of uploaded PDFs, Saved words list, Flashcard review session**.\n\n## The Kitchen: API Routes + Translation Engine\nThe server-side brains live in `app/api/translate/route.ts`. When a user taps a word, here's what happens behind the scenes:\n![Translation example](Images/Technical/Translation.png)\n\n## The Pantry: Supabase\n\nSupabase is our entire backend: authentication, database, and file storage in one service. \n\n\n\n",
  "excerpt": "What Is This Thing?\n\nAs someone who grew up in China and whose native language is Chinese, I’ve always tried to find better ways to improve my Englis..."
}